# Как да събираме промените - крайните потребители могат да публикуват клонове на публичното репо от съучастници. Репо-то избира дали да приеме клона по това дали комита минава проверките. Клона следва да е с име <публичен-ключ-на-променящия>-<минута>

# Значи архитектурата е:
# имаме съучастници със гит адреси
# имаме хора които правят промени, които трябва да имат ключ - с този ключ им се позволява да правят промени
# Използвам приложението Termux и https://wiki.termux.com/wiki/Remote_Access тези инструкции. При грешка git remote HEAD refers to nonexistent ref: cd path/to/git/repo; git symbolic-ref HEAD refs/heads/main
# Първоначално съучастниците (на всякаква линукс конзола, включително андроид телефони) теглят от zhiva.be/minalo последното репо (с wget например) правят install.sh (TODO)
# pip install virtualenv
# Правят virtualenv venv
# source venv/bin/activate
# pip install -r requirements.txt
# После стартират python минало.py

